app/controllers/comments_controller.rb

  def index
    params.permit(:post_id)
    if params[:post_id]
      if current_user.is_admin?
        @comments = Comment.where(:post_id => params[:post_id]).includes(:user)
      else
        @comments = Comment.where(:post_id => params[:post_id], :is_validated => true).includes(:user)
---
SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = 1 AND "comments"."is_validated" = 't'