app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "<p>Test</p>\r\n"], ["created_at", "2014-10-12 15:23:58.198753"], ["title", "Test"], ["updated_at", "2014-10-12 15:23:58.198753"]]